backend/controllers/NodeTagController.php

SELECT * FROM `lc_node_tag`
---
    public function actionGetTag(){
        $res = NodeTag::find()->all();