backend/controllers/NodeGroupController.php

SELECT * FROM `lc_node`
---
    public function actionGetNode(){
        //$model = new Node();
        //$res = $model->idToIp();
        $res = Node::find()->all();