frontend/controllers/AuthController.php

    public function beforeAction($action)
    {
        //验证签名
        $header = \Yii::$app->request->headers;
        $token = $header['token'];

        $getPayloadt=\frontend\components\Jwt::verifyToken($token);

        if(!$getPayloadt){
            echo json_encode(['code'=>3001,'msg'=>'请登陆','data'=>'']);
            return false;
        }
        if(isset($getPayloadt['data'])){
            $id = $getPayloadt['data']['uid'];
            $res = User::findOne($id);
---
SELECT * FROM `lc_user` WHERE `id`='2'