api/controllers/SiteController.php

UPDATE `lc_node_remark` SET `password`='testmima' WHERE `id`='1'
---
    public function actionNodeRemark(){

        if(Yii::$app->request->isPost){
            $id = Yii::$app->request->post('id','');
            $password = Yii::$app->request->post('password','');
            $token = Yii::$app->request->post('token','');
            if(empty($id)||empty($password)||empty($token))
                return $this->error("data error");
           if($token != $this->node_remark_token)
               return $this->error("token error");
           $model =  NodeRemark::find()->where(['node_id'=>$id])->one();
           if($model){
               $model->password = $password;
               if($model->validate())
               {
                   if($model->save()){