backend/models/CountryType.php

SELECT * FROM `lc_country_type`
---
    public function idToType(){
        $res = CountryType::find()->asArray()->all();