backend/models/NodeTag.php

SELECT COUNT(*) FROM `lc_node_tag`
---
    public function getList($page,$pagenum='',$where=[]){
        if(empty($pagenum)){
            $pagenum = $this->pagenum;
        }
        //设置起始位置
        $offset = 0;
        if(!empty($page) && is_numeric($page) && $page > 1){
            $offset = ($page-1) * $pagenum;
        }else{
            $page = 1;
        }
        $list = $this->find();

        if(!empty($where)){
            $i = 0;
            foreach ($where as $k=>$v){
                if($i==0){
                    $list->where($v);
                }else{
                    $list->andWhere($v);
                }
                $i++;
            }
        }

        $count = $list->count();  //总条数

SELECT * FROM `lc_node_tag`
---
    public function idToName(){
        $res = NodeTag::find()->asArray()->all();

SELECT * FROM `lc_node_tag` WHERE `id`='6'
---
    public function getOne($id){
        $model = NodeTag::find()->where(['id'=>$id])->asArray()->one();