backend/models/NodeKit.php

    public function idToName(){
        $res = NodeKit::find()->asArray()->all();
---
SELECT * FROM `lc_node_kit`