backend/models/NodeRemark.php

SELECT COUNT(*) FROM `lc_node_remark` `r` INNER JOIN `lc_node` `n` ON n.id = r.node_id
SELECT `r`.`id`, `r`.`other_ip`, `r`.`remark`, `r`.`password`, `n`.`zabbix_ip`, `n`.`tag_ids` FROM `lc_node_remark` `r` INNER JOIN `lc_node` `n` ON n.id = r.node_id ORDER BY `id` DESC LIMIT 1000
SELECT * FROM `lc_node_tag`
---
    public function getList($page=1,$pagenum='',$where=[]){
        if(empty($pagenum)){
            $pagenum = $this->pagenum;
        }
        $pagenum = 1000;
        //设置起始位置
        $offset = 0;
        if(!empty($page) && is_numeric($page) && $page > 1){
            $offset = ($page-1) * $pagenum;
        }else{
            $page = 1;
        }
        $list = $this->find()->alias('r')->innerJoin("{{%node}} as n",'n.id = r.node_id')->select('r.id,r.other_ip,r.remark,r.password,n.zabbix_ip,n.tag_ids');

        if(!empty($where)){
            $i = 0;
            foreach ($where as $k=>$v){
                if($i==0){
                    $list->where($v);
                }else{
                    $list->andWhere($v);
                }
                $i++;
            }
        }
        $count = $list->count();  //总条数
        $allpage = 1;
        $csdatas = [];
        if($page <= $allpage){
            $list->offset($offset)->limit($pagenum)->orderBy('id DESC');
            $datas = $list->asArray()->all();

            if($datas){
                $tagList = NodeTag::find()->asArray()->all();

SELECT * FROM `lc_node_remark` WHERE `id`='465'
---
    public function updateRemark($data){
        $model = $this::findOne($data['id']);
        if(!$model){
            return $this->error('未找到相应数据');
        }
        unset($data['id']);
        if($data && $model->load($data,'')){