backend/models/Node.php

    public function getList($page=1,$pagenum='',$where=[]){
        if(empty($pagenum)){
            $pagenum = $this->pagenum;
        }
        $pagenum = 1000;
        //设置起始位置
        $offset = 0;
        if(!empty($page) && is_numeric($page) && $page > 1){
            $offset = ($page-1) * $pagenum;
        }else{
            $page = 1;
        }
        $list = $this->find();

        if(!empty($where)){
            $i = 0;
            foreach ($where as $k=>$v){
                if($i==0){
                    $list->where($v);
                }else{
                    $list->andWhere($v);
                }
                $i++;
            }
        }
        $count = $list->count();  //总条数
---
SELECT COUNT(*) FROM `lc_node`


            if($datas){
                self::$groupName = self::idToGroupName();
                $tagList = NodeTag::find()->asArray()->all();
---
SELECT * FROM `lc_node_tag`

    public static function idToGroupName()
    {
        $res = NodeGroup::find()->asArray()->all();
---
SELECT * FROM `lc_node_group`