backend/models/Package.php

    public function idToName()
    {
        $res = Package::find()->asArray()->all();
---
SELECT * FROM `lc_package`