backend/models/User.php

    public function getIdToUsername(){
        $res = User::find()->asArray()->all();
---
SELECT * FROM `lc_user`