frontend/models/Brand.php

    public function idToName($uid = 0){
        $res = Brand::find()->where(['user_id'=>$uid])->asArray()->all();
---
SELECT * FROM `lc_brand` WHERE `user_id`='2'