frontend/models/Package.php

    public function idToName($uid)
    {
        $res =  PackageUser::find()->where(['{{%package_user}}.user_id'=>$uid])->select('{{%package}}.id,{{%package}}.name')->innerJoin('{{%package}}','{{%package}}.id = {{%package_user}}.package_id')->asArray()->all();
---
SELECT `lc_package`.`id`, `lc_package`.`name` FROM `lc_package_user` INNER JOIN `lc_package` ON `lc_package`.id = `lc_package_user`.package_id WHERE `lc_package_user`.`user_id`='2'

    public static function getPackInfo($user_id,$package_id)
    {
        $res = PackageUser::find()->where(['{{%package_user}}.user_id'=>$user_id,'package_id'=>$package_id])->select('{{%package}}.*')->innerJoin('{{%package}}','{{%package}}.id = {{%package_user}}.package_id')->asArray()->one();
---
SELECT `lc_package`.* FROM `lc_package_user` INNER JOIN `lc_package` ON `lc_package`.id = `lc_package_user`.package_id WHERE (`lc_package_user`.`user_id`='2') AND (`package_id`=3)