api/models/ApiModel.php

SELECT * FROM `lc_node` WHERE `ip`='176.113.68.40'
---
    public static function change_node_status($ip,$alive_z_num,$z_num){
        //update lc_node set alive_z_1=1,status=1 where ip='$IP'
        $model = Node::find()->where(['ip'=>$ip])->one();